% 移动预测前 时延
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [2.0415,1.8682,1.8975,1.9648,1.9306,1.9851,1.9491,1.9263,1.9271,1.946,1.9256,1.9266,1.9161,1.9582,1.9466,1.926,1.9428,1.9259,1.9442,1.9314,1.9294,1.9274,2.5428,3.005,3.5486,4.1449,4.856,5.6399,6.4235,7.471];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','移动预测后_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [2.0708,1.8695,1.9713,1.9845,1.9354,1.9526,1.9415,1.9257,1.9523,1.9714,1.9728,2.5667,2.9336,3.4735,3.8844];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [1.8476,1.9002,1.9431,1.8972,1.9062,1.8756,1.8762,1.9008,1.9258,1.9134,1.8521,1.8816,1.925,1.9054,1.9237];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f2,'-dpng','-r600','移动预测后_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [1.9735,1.9322,1.9424,1.9662,1.9162,1.9193,1.959,2.5406,2.9539,3.3265];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [1.9156,1.9036,1.9685,1.9403,1.9169,1.8605,1.9024,1.8848,1.9159,1.9263];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [1.9403,1.837,1.8697,1.869,1.8715,1.8781,1.8542,1.8395,1.8791,1.9018];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','移动预测后_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [1.8895,1.9308,1.8491,1.9228,1.9015,2.4891,2.9047];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [1.8769,1.9342,1.8538,1.9352,1.903,1.9187,1.9211];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [1.8803,1.829,1.8812,1.9217,1.8569,1.887,1.84];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [1.8491,1.8344,1.7682,1.8551,1.8248,1.8502,1.8653];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','移动预测后_时延4');