% 移动预测前 时延
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [6.608, 6.588, 6.5947, 6.578, 6.6, 6.608, 6.5851, 6.598, 6.5991, 6.604, 6.5971, 6.5847, 6.5865, 6.5794, 6.5787, 6.573, 6.6245, 6.6147, 6.6101, 6.608, 6.6099, 6.6025, 8.7271, 10.3132, 12.1, 14.1075, 16.4065, 19.0281, 22.043, 25.5309];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','移动预测后_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [7.7376, 7.8336, 7.9136, 7.9176, 7.9584, 7.9936, 7.957, 7.9416, 7.9616, 7.9536, 7.9427, 15.7323, 26.7535, 44.8339, 75.0089];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [6.608, 6.668, 6.728, 6.638, 6.624, 6.5813, 6.6251, 6.643, 6.5947, 6.588, 6.5862, 6.6047, 6.608, 6.6137, 6.6133];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f2,'-dpng','-r600','移动预测后_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [9.0272, 9.1392, 9.2325, 9.3772, 9.3072, 9.2885, 9.3232, 25.537, 57.7645, 129.519];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [7.9296, 8.0016, 8.0736, 7.8816, 7.9008, 7.8736, 7.8542, 7.8936, 7.9509, 7.944];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [6.728, 6.788, 6.5813, 6.528, 6.576, 6.6747, 6.6537, 6.633, 6.5902, 6.588];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','移动预测后_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [10.5088, 10.6368, 10.7221, 10.7168, 10.6368, 58.3851, 251.778];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [9.4192, 9.4472, 9.1952, 9.1952, 9.2176, 9.1859, 9.1632];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [8.1696, 7.8096, 7.9136, 7.8336, 7.8912, 8.0096, 7.9845];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [6.688, 6.628, 6.528, 6.628, 6.664, 6.588, 6.5909];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','移动预测后_时延4');