% 移动预测前 吞吐量
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [441.274, 881.966, 1322.96, 1763.8, 2205.5, 2645.27, 3085.97, 3526.73, 3967.27, 4408.4, 4849.73, 5291.26, 5732.16, 6173.23, 6613.78, 7054.42, 7495.48, 7937.08, 8378.5, 8820.02, 9260.82, 9701.11, 9943.2, 9734.4, 9928.8, 9784.8, 9849.6, 9914.4, 9864, 9849.6];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

axis([0 60 0 10500]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','移动预测后_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [440.417, 882.977, 1322.45, 1764.07, 2206.55, 2646.7, 3086.21, 3528.06, 3969.1, 4410.18, 4849.92, 4443.24, 4054.14, 3743.1, 3236.59];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [440.578, 881.573, 1323.19, 1765.03, 2203.97, 2646.39, 3088.05, 3526.69, 3967.98, 4409.85, 4851.19, 5291.16, 5730.66, 6171.3, 6613.01];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','移动预测后_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [440.578, 881.573, 1323.19, 1764.36, 2206.05, 2645.88, 3085.81, 2687.68, 1905.99, 1007.41];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [441.403, 881.69, 1324.17, 1764.68, 2204.63, 2644.39, 3086.13, 3525.85, 3966.35, 4409.6];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [441.574, 882.377, 1322.53, 1764.06, 2203.82, 2645.34, 3084.62, 3528.07, 3970.06, 4410.99];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','移动预测后_吞吐量3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [441.048, 881.676, 1322.98, 1764.68, 2204.63, 1805.64, 567.6];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [440.479, 881.119, 1324.23, 1764.06, 2203.82, 2645.34, 3084.62];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [441.046, 881.59, 1322.57, 1762.5, 2204.23, 2643.51, 3088.22];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [441.528, 882.766, 1323.31, 1763.94, 2203.66, 2647.11, 3087.56];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f4,'-dpng','-r600','移动预测后_吞吐量4');