% 移动预测前 时延
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [13.296, 13.096, 13.0827, 13.096, 13.072, 13.0693, 13.1017, 13.076, 13.0649, 13.056, 13.0705, 13.116, 13.1483, 13.1531, 13.1627, 13.171, 13.1831, 13.1716, 13.1655, 13.188, 13.1779, 13.176, 17.3992, 20.5631, 24.1141, 28.1308, 32.7037, 37.9436, 43.9611, 50.8945];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','移动预测前_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [15.7632, 16.0032, 15.9552, 16.0512, 15.9936, 16.0192, 15.9415, 15.9552, 15.9339, 15.9456, 15.9465, 31.5596, 53.6722, 89.9317, 150.448];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [13.056, 13.416, 13.4027, 13.216, 13.248, 13.216, 13.296, 13.256, 13.2782, 13.216, 13.1942, 13.196, 13.2037, 13.176, 13.1787];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f2,'-dpng','-r600','移动预测前_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [18.8384, 18.6704, 18.6144, 18.7264, 18.6592, 18.6891, 18.5984, 51.1896, 115.798, 259.66];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [15.8592, 16.0992, 16.0832, 15.8592, 15.8976, 15.8592, 15.9552, 15.9072, 15.9339, 15.8592];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [13.216, 13.296, 13.136, 13.256, 13.312, 13.2693, 13.1817, 13.166, 13.1804, 13.208];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','移动预测前_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [21.5296, 21.3376, 21.2736, 21.4016, 21.3248, 117.474, 506.408];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [18.5024, 18.7824, 18.7637, 18.5024, 18.5472, 18.5024, 18.6144];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [15.8592, 15.9552, 15.7632, 15.9072, 15.9744, 15.9232, 15.8181];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [13.616, 13.136, 13.296, 13.256, 13.12, 13.1227, 13.1703];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','移动预测前_时延4');