% 移动预测优化对比 吞吐量
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [287.45,574.72,862.1943,1149.7267,1437.09,1724.5733,2011.78,2299.2833,2586.7533,2874.1667,3161.28,3448.5967,3736.49,4023.35,4310.88,4598.1167,4885.8533,5173.1533,5460.8433,5748.06,6035.7833,6322.85,6386.1333,6389.8667,6377.3333,6380.5333,6369.0667,6376.5333,6373.8667,6379.4667];
afterOptY = [323.3293,646.738,970.04,1293.1667,1616.74,1939.9267,2263.42,2586.7133,2909.9267,3233.4033,3556.9067,3880.1867,4203.3867,4526.6333,4849.7067,5173.2733,5496.4867,5820.09,6143.2667,6466.92,6789.81,7113.86,7171.8,7161.6,7181.1,7170,7189.8,7184.1,7182.3,7188.9];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','移动预测优化对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [287.3323,574.9793,862.2037,1149.25,1437.1333,1724.6533,2011.76,2299.0933,2586.4833,2874.1433,3161.7,3000.4533,2721.26,2437.83,2165.12];
%   两种业务类型-B
beforeOptY2 = [281.0443,562.0193,842.9653,1123.98,1405.3667,1686.0767,1966.87,2247.91,2528.4967,2810.2467,3090.96,3371.8133,3652.8733,3934.17,4215.1467];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [323.262,646.659,970.209,1293.1467,1616.7533,1939.8967,2263.63,2586.8867,2909.9233,3233.5667,3557.24,3393.8533,3064.72,2755.3433,2419.4933];
%   两种业务类型-B
afterOptY2 = [316.1333,632.4207,948.373,1264.5133,1580.3133,1896.72,2212.8267,2528.93,2845.3667,3161.0833,3477.4267,3793.2467,4109.78,4426.0567,4742.1067];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','移动预测优化对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [287.2873,574.7283,862.1987,1149.7833,1436.8767,1724.3867,2011.8167,1936.9433,1374.26,827.362];
%   三种业务类型-B
beforeOptY2 = [281.0363,562.0863,843.119,1123.84,1405.3133,1685.7067,1966.8833,2248.0267,2529.5,2810.2433];
%   三种业务类型-C
beforeOptY3 = [274.575,549.2343,823.7647,1098.47,1372.9067,1647.3967,1922.0433,2196.8967,2471.4433,2746.1267];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [323.425,646.7003,970.0083,1293.18,1616.87,1940.21,2263.6567,2161.9867,1556.0133,926.015];
%   三种业务类型-B
afterOptY2 = [316.1593,632.212,948.4517,1264.48,1580.7667,1896.53,2213.1367,2529.18,2845,3161.2967];
%   三种业务类型-C
afterOptY3 = [308.9213,617.8133,926.7143,1235.7967,1544.9,1853.5933,2162.58,2471.6333,2780.3867,3088.9867];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','移动预测优化对比_吞吐量3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

hold on
x = [8,16,24,32,40,48,56];
%   四种业务类型-A
beforeOptY1 = [287.4127,574.8107,862.1603,1149.6133,1437.0567,1433.1467,627.728];
%   四种业务类型-B
beforeOptY2 = [280.9093,561.8757,842.949,1124.08,1404.9867,1685.97,1967.18];
%   四种业务类型-C
beforeOptY3 = [274.64,549.2453,823.7623,1098.28,1372.9267,1647.3467,1922.2033];
%   四种业务类型-D
beforeOptY4 = [268.1377,536.3287,804.728,1072.71,1341.1467,1609.2667,1877.2867];

beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3 + beforeOptY4;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   四种业务类型-A
afterOptY1 = [323.2083,646.5227,969.6717,1293.2067,1616.63,1618.7767,692.5913];
%   四种业务类型-B
afterOptY2 = [316.16,632.1907,948.498,1264.45,1580.52,1896.8667,2212.59];
%   四种业务类型-C
afterOptY3 = [308.8453,617.9337,926.7067,1235.6233,1544.51,1853.5467,2162.2967];
%   四种业务类型-D
afterOptY4 = [301.756,603.291,904.994,1206.81,1508.5767,1810.1067,2111.8167];

afterOptY = afterOptY1 + afterOptY2 + afterOptY3 + afterOptY4;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f4,'-dpng','-r600','移动预测优化对比_吞吐量4');