clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   正常通信场景
%   三种业务类型A
y1 = [5.7187, 5.4499, 5.5283, 5.6431, 5.5642, 5.6179, 5.5651, 15.3684, 34.8346, 77.6434];

%   三种业务类型-B
y2 = [5.158, 5.1739, 5.2004, 5.3011, 5.3106, 5.211, 5.2261, 7.3289, 10.3382, 13.2883];

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[4.926, 4.941, 5.006, 4.956, 4.986, 4.991, 4.9689, 5.001, 4.9193, 4.986];

%   求出系统吞吐量
total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '正常通信场景')
hold on

%   动态误码场景
%   三种业务类型-A
y11 = [14.2128, 14.0028, 13.8768, 13.8768, 13.9608, 13.7788, 14.0328, 38.2767, 85.9969, 195.195];

%   三种业务类型-B
y22 = [12.4124, 12.5279, 12.5921, 12.7397, 12.6126, 12.6947, 12.8304, 12.7974, 12.9343, 12.7897];

%   三种业务类型-C
y33 = [11.494, 11.634, 11.6107, 11.6165, 11.718, 11.5523, 11.554, 11.599, 11.5718, 11.704];

total_dynamic = y11 + y22 + y33;
plot(x3,total_dynamic,'*-','linewidth',lineWidth, 'DisplayName', '动态误码场景');

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','动态误码_正常通信时延对比3');