clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   正常通信场景
%   三种业务类型-A
y1 = [485.554, 969.981, 1454.84, 1941.24, 2425.74, 2910.7, 3397.32, 2971.31, 2065.12, 1171.94];

%   三种业务类型-B
y2 = [484.741, 970.372, 1455.14, 1938.72, 2425.05, 2910.75, 3394.68, 3880.12, 4365.98, 4850.49];

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [485.037, 970.976, 1455.42, 1940.81, 2425.19, 2909.93, 3396.93, 3880.17, 4363.87, 4851.73];

%   求出系统吞吐量
total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '正常通信场景')
hold on

%   动态误码场景
%   三种业务类型-A
y11 = [392.442, 783.936, 1176.18, 1567.42, 1960.01, 2352.21, 2744.8, 2561.46, 1842.93, 1006.11];

%   三种业务类型-B
y22 = [392.51, 783.917, 1176.41, 1567.7, 1960.1, 2353.07, 2743.8, 3136.49, 3528.16, 3919.49];

%   三种业务类型-C
y33 = [392.222, 783.548, 1176.34, 1567.45, 1959.33, 2350.8, 2743.71, 3136.45, 3528.91, 3919.19];

total_dynamic = y11 + y22 + y33;
plot(x3,total_dynamic,'*-','linewidth',lineWidth, 'DisplayName', '动态误码场景');

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','动态误码_正常通信吞吐量对比3');