%   三种业务类型的时延
%   业务区分，时延
%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [1.839, 1.8614, 1.8428, 1.8586, 1.8704, 1.8726, 1.8534, 5.0728, 11.4429, 25.5187];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [1.7935, 1.7617, 1.7547, 1.7829, 1.7426, 1.7476, 1.7617, 1.7723, 1.7664, 1.7628];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [1.642, 1.642, 1.6453, 1.6695, 1.66, 1.6703, 1.6491, 1.662, 1.6442, 1.663];
plot(x3,y3,'s-','linewidth',1.2, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_时延3');