%% 一种业务类型的吞吐量
%   业务区分，一种业务类型-吞吐量
%   一种业务类型-A
clear;clc;clf
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [359.2633,718.4670,1077.7200,1436.9533,1796.0900,2155.8067,2514.7133,2874.4233,3233.1900,3592.6133,3952.3067,4311.1933,4670.6933,5029.2500,5388.7600,5748.1433,6106.4167,6465.9067,6826.9600,7185.5767,7544.0033,7903.2600,7968.0000,7978.6667,7972.0000,7975.3333,7973.0000,7976.3333,7966.3333,7969.6667];
plot(x1,y1,'*-', 'linewidth',1.2, 'DisplayName', '业务类型A');
hold on

axis([0 60 0 8500]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on;

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_吞吐量1');