%   一种业务类型的吞吐量
%   业务区分，一种业务类型-吞吐量
%   一种业务类型-A
clear;clc;clf
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [70.09,140.777,210.848,280.924,350.823,421.338,492.031,561.22,632.438,703.002,772.767,842.553,913.544,983.895,1053.99,1123.9,1194.55,1264.34,1335.02,1404.42,1475.42,1546.08,1552,1586,1593,1571,1591,1589,1581,1586];
plot(x1,y1,'*-', 'linewidth',1.2, 'DisplayName', '业务类型A');
hold on

axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on;