%% 一种业务类型的吞吐量
%   业务区分，一种业务类型-吞吐量
%   一种业务类型-A
clear;clc;clf
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [78.444,156.476,234.858,313.12,390.85,469.488,547.736,626.328,704.511,782.45,861.069,939.42,1017.445,1095.598,1173.495,1251.568,1330.063,1408.374,1486.75,1565.32,1643.082,1721.962,1777.601,1771.008,1786.675,1783.002,1791.99,1794.66,1768.681,1773.66];
plot(x1,y1,'*-', 'linewidth',1.2, 'DisplayName', '业务类型A');
hold on

axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on;