% 三种业务类型的吞吐量

%   业务区分，三种业务类型-吞吐量
clear;clc
lineWidth = 1.2;  % 线宽
%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [71.4416,142.7603,214.1004,285.9045,356.9912,428.524,499.6405,571.4705,504.5544,384.3735];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [65.0651,130.0505,195.1074,260.0447,324.764,390.1639,455.2503,520.1074,585.0137,650.028];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [59.5286,119.0596,178.4106,237.9121,297.8318,356.8878,417.1019,476.6898,535.736,595.4647];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on