%   两种业务类型的时延
%   业务区分，时延
%   两种业务类型-A
clear;clc;
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [0.4820,0.4965,0.4962,0.4895,0.4822,0.4951,0.4914,0.4813,0.4867,0.4837,0.4750,0.6412,0.7465,0.8661,0.9664];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [0.4592,0.4927,0.4852,0.4619,0.4806,0.4837,0.4739,0.4664,0.4792,0.4686,0.4746,0.4726,0.4738,0.4861,0.4710];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_时延2');
