%   四种业务类型的时延
%   业务区分，时延
%   四种业务类型A
x1 = [8,16,24,32,40,48,56];
y1 = [0.4977,0.4872,0.4927,0.4945,0.4882,0.6279,0.7279];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A')
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [0.5042,0.4729,0.4753,0.4793,0.4703,0.4720,0.4748];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')
hold on

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [0.4404,0.4703,0.4823,0.4778,0.4698,0.4640,0.4711];
plot(x3,y3,'s-','linewidth',1.2, 'DisplayName', '业务类型C');

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [0.4506,0.4579,0.4473,0.4515,0.4711,0.4620,0.4765];
plot(x4, y4,'^-','linewidth',1.2, 'DisplayName', '业务类型D');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_时延4');