%% 一种业务类型的时延
%节点数—时延：
%       路由重构
%   业务区分，时延
%   一种业务类型
clear;clc;
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [0.4627,0.4710,0.4947,0.4711,0.4866,0.4770,0.4815,0.4843,0.4789,0.4879,0.4759,0.4869,0.4886,0.4810,0.4928,0.4868,0.4862,0.4890,0.4838,0.4859,0.4786,0.4852,0.6351,0.7584,0.8863,1.0263,1.1972,1.3806,1.6249,1.8591];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_时延1');