% 四种业务类型的吞吐量

%   业务区分，四种业务类型-吞吐量
clear;clc
lineWidth = 1.2;  % 线宽
%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [359.2967,718.5223,1077.7067,1436.8800,1796.0300,1795.1967,751.0417];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [351.3080,702.3050,1053.8933,1404.9300,1756.2833,2107.5767,2459.0200];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [343.1377,686.3203,1029.6667,1373.1867,1715.9367,2059.5667,2402.5900];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [337.8240,670.4980,1005.7500,1340.7400,1676.2867,2011.6600,2347.3467];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_吞吐量4');