% 两种业务类型的吞吐量

%   业务区分，两种业务类型-吞吐量
clear;clc;
%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [71.4085,142.8999,214.0278,285.5487,356.7567,428.694,499.7792,570.969,642.8032,714.6694,785.5265,856.778,776.0896,708.7119,637.0743];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [65.0259,130.0079,194.7874,260.0079,325.0143,389.9702,454.7512,520.0401,585.0006,650.0021,714.962,779.8513,845.2606,909.597,974.8479];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on