%   三种业务类型的时延
%   业务区分，时延
%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [2.6775,5.195,7.8825,10.55,13.2275,15.815,18.2625,21.14,31.37313,40.061];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [2.43125,4.9525,7.37375,9.775,12.37625,14.8075,17.21875,19.75,22.50125,24.5425];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[2.355,4.62,6.875,9.32,11.585,13.97,16.245,18.63,20.795,23.17];
plot(x3,y3,'s-','linewidth',1.2, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on