% 三种业务类型的吞吐量

%   业务区分，三种业务类型-吞吐量
clear;clc
lineWidth = 1.2;  % 线宽
%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [78.3,156.4653333,234.654,313.3513333,391.2623334,469.6623334,547.606,626.3316666,552.9916333,421.2733333];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [71.31133333,142.5353333,213.8376667,285.009,355.9413334,427.6196666,498.9543334,570.0376666,641.175,712.4306667];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [65.24333333,130.4893333,195.538,260.7516667,326.4236667,391.149,457.1436667,522.452,587.1666667,652.6293333];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on