% 两种业务类型的吞吐量

%   业务区分，两种业务类型-吞吐量
clear;clc;
%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [78.26366667,156.6183333,234.5745,312.9613333,391.0053334,469.8486667,547.758,625.782,704.5123334,783.2776667,860.937,939.0286667,850.5942333,776.7482667,698.2334];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [71.26833333,142.4886667,213.487,284.9686667,356.2156667,427.4073334,498.4073333,569.964,641.1606666,712.4023333,783.5983333,854.717,926.4056667,996.9183333,1068.433333];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on