% 两种业务类型的吞吐量

%   业务区分，两种业务类型-吞吐量
clear;clc;
%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [359.2987,718.6143,1077.8067,1437.1133,1796.3900,2155.7500,2515.0267,2874.1233,3232.9200,3592.2500,3951.7567,3750.3167,3416.1700,3069.1133,2707.4000];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [351.4020,702.3863,1053.9633,1405.2167,1756.3733,2107.8067,2459.0867,2810.2167,3161.4733,3512.8867,3863.8900,4215.3500,4566.5000,4917.8867,5268.9333];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_吞吐量2');