%% 一种业务类型的时延
%节点数—时延：
%       路由重构
%   业务区分，时延
%   一种业务类型
clear;clc;
x1=[2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [2.63187,5.24375,7.78562,10.4775,13.0994,15.6312,18.2631,20.835,23.3569,25.8787,28.9206,31.3925,33.9344,36.8063,39.2681,41.88,44.3919,47.2437,49.7256,52.3275,54.7794,57.7313,78.8873,97.8827,119.506,145.48,174.688,211.091,252.607,303.086];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on
