%   两种业务类型的时延
%   业务区分，时延
%   两种业务类型-A
clear;clc;
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [1.7617, 1.7511, 1.7511, 1.7564, 1.7617, 1.7476, 1.7663, 1.7511, 1.7629, 1.7607, 1.7511, 3.4742, 5.8533, 9.9471, 16.6248];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [1.692, 1.692, 1.6887, 1.662, 1.668, 1.6453, 1.6563, 1.6558, 1.6576, 1.649, 1.6702, 1.6653, 1.6482, 1.6656, 1.6707];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_时延2');
