% 两种业务类型的吞吐量

%   业务区分，两种业务类型-吞吐量
clear;clc;
%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [489.632, 980.069, 1469.78, 1958.74, 2449.43, 2940.45, 3429.14, 3920.43, 4408.44, 4898.13, 5390.46, 5162.19, 4566.78, 4246.42, 3497.61];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [489.872, 980.661, 1470.84, 1959.6, 2448.06, 2940.58, 3430.63, 3919.14, 4410.4, 4897.85, 5389.76, 5877.81, 6369.22, 6857.58, 7350.39];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_吞吐量2');