%% 一种业务类型的时延
%节点数—时延：
%       路由重构
%   业务区分，时延
%   一种业务类型
clear;clc;
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [1.702, 1.662, 1.6453, 1.6345, 1.67, 1.6553, 1.6577, 1.6695, 1.6687, 1.666, 1.6584, 1.6578, 1.6512, 1.6477, 1.664, 1.6507, 1.6491, 1.6542, 1.6673, 1.6565, 1.6425, 1.6652, 2.1904, 2.5781, 3.0299, 3.5456, 4.0952, 4.7586, 5.5135, 6.4168];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_时延1');