%   两种业务类型的时延
%   业务区分，时延
%   两种业务类型-A
clear;clc;
x1=[4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [2.6575,5.275,7.8525,10.54,13.1175,15.755,18.4125,21.14,23.6375,26.335,28.7925,41.6856,52.50766,65.37532,79.8568];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [2.52125,5.0025,7.36375,9.925,12.27625,14.9075,17.40875,19.8,22.36125,24.7525,27.06375,29.705,32.09625,34.7875,37.20875];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on
