%   两种业务类型的吞吐量
%   业务区分，两种业务类型-吞吐量
clear;clc;
%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [70.427,140.507,211.102,280.755,351.614,421.568,491.115,561.856,631.978,702.497,772.851,790.94,755.659,656.661,625.438];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [64.187,128.851,192.965,257.289,321.204,385.907,449.91,514.098,578.503,642.645,707.324,770.06,835.341,899.339,963.562];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on