% 三种业务类型的吞吐量

%   业务区分，三种业务类型-吞吐量
clear;clc
lineWidth = 1.2;  % 线宽
%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [359.2667,718.6743,1077.8900,1436.9933,1796.1467,2155.3600,2514.9167,2420.4200,1717.1000,1033.7767];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [351.1843,702.3690,1053.5133,1405.0600,1756.0633,2107.6100,2458.9233,2810.0067,3161.1700,3512.8200];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [343.3750,686.5350,1029.9000,1373.0100,1715.9567,2059.5567,2402.3867,2745.9067,3089.3933,3432.4033];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_吞吐量3');