%% 一种业务类型的吞吐量
%   业务区分，一种业务类型-吞吐量
%   一种业务类型-A
clear;clc;clf
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [490.208, 980.595, 1470.36, 1959.89, 2450.07, 2941.18, 3431, 3921.45, 4409.49, 4901.79, 5389.69, 5880.18, 6371, 6859.81, 7350.3, 7840.54, 8327.91, 8815.2, 9309.3, 9800.02, 10285.6, 10780.3, 10808, 10840, 11064, 11104, 11040, 11160, 10824, 11064];
plot(x1,y1,'*-', 'linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 8500]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on;

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试单跳_吞吐量1');