% 三种业务类型的时延
% 节点数—时延：3333
%       路由重构
%   业务区分，时延
%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [2.819376667,5.60542,8.481459999,11.23416333,14.04020667,16.82625,19.66227667,22.50166666,33.33137333,42.75671333];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [2.653123333,5.339586666,7.966036668,10.63916667,13.24561667,15.90542,18.54188,21.18167,23.84145333,26.46125];
plot(x2,y2,'o-','linewidth',1.2, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[2.476873333,4.967086666,7.487289999,9.987493332,12.49770667,14.97791,17.43812,20.0116,22.36853667,24.93875667];
plot(x3,y3,'s-','linewidth',1.2, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on