% 多跳网络两种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [1.5201,1.4816,1.4358,1.4276,1.4519,1.4645,1.4543,1.4621,1.4578,1.4628,1.4485,1.9565,2.2204,2.567,2.9332];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A')
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [1.3807,1.4857,1.4154,1.3949,1.4103,1.4249,1.44,1.4058,1.4095,1.4414,1.4346,1.4309,1.4194,1.4066,1.4182];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延2');
