% 三种业务类型的时延
% 节点数—时延：3333
%       路由重构
%   业务区分，时延
%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [9.7916,19.1496,29.7078,42.3892,48.747,60.1986,75.9668,80.3952,119.6739,150.117];
plot(x1,y1,'r*-','linewidth',1.2, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [9.2427,19.9588,28.9716,39.7676,51.607,55.0494,68.5559,74.7584,91.3212,97.757];
plot(x2,y2,'bo-','linewidth',1.2, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[8.1473,20.0012,29.2185,35.5596,49.8165,57.8334,65.7475,78.9248,80.4258,98.516];
plot(x3,y3,'gs-','linewidth',1.2, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on