% 多跳网络一种业务类型--时延
%   一种业务类型
clear;clc
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [1.4801,1.4751,1.3775,1.4794,1.4973,1.4325,1.484,1.4457,1.4641,1.4218,1.4569,1.4592,1.4592,1.4355,1.4409,1.4832,1.4594,1.4701,1.4507,1.459,1.4446,1.4493,1.9103,2.2778,2.6983,3.1031,3.5945,4.1426,4.8757,5.628];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延1');
