% 多跳网络三种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [1.4031,1.3946,1.4525,1.4386,1.4571,1.4483,1.4883,1.9023,2.2143,2.5296];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [1.4077,1.3672,1.4034,1.4242,1.4299,1.4065,1.4133,1.4414,1.4205,1.4053];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[1.4363,1.4062,1.3622,1.3703,1.417,1.3818,1.4542,1.4218,1.3981,1.4258];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延3');