%   多跳
%   三种业务类型的吞吐量
%   业务区分，三种业务类型-吞吐量
clear;clc
lineWidth = 1.2;  % 线宽
%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [78.1513,156.401,234.8652,313.0704,391.3795,469.584,547.6492,625.9904,539.3088,413.187];
plot(x1,y1,'r*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [71.244,142.509,213.5817,285.06,356.0895,427.2414,498.9544,569.9712,641.9556,712.431];
plot(x2,y2,'bo-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [65.347,130.3156,195.8994,261.2968,325.8445,391.2234,456.442,522.1568,587.4021,652.382];
plot(x3,y3,'g-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on