% 多跳网络一种业务类型--吞吐量
%   一种业务类型
clear;clc;
x1=[2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [484.458, 970.139, 1454.46, 1940.14, 2426.46, 2911.03, 3395.3, 3880.15, 4366.21, 4848.85, 5336.41, 5822.54, 6304.44, 6791.98, 7277.61, 7765.75, 8246.59, 8733.59, 9217.08, 9701.55, 10186.3, 10671.3, 11040.5, 10731.6, 10993, 10763.3, 10795, 11024.6, 10699.9, 10739.5];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量1');