% 多跳网络一种业务类型--吞吐量
%   一种业务类型
clear;clc;
x1=[2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [78.233,156.412,234.684,312.96,391.445,469.56,547.883,626.368,704.241,782.99,860.255,938.544,1016.756,1095.486,1173.75,1252.048,1330.012,1408.464,1486.978,1564.84,1643.922,1721.478,1729.681,1743.312,1776,1767.662,1771.011,1772.008,1760.677,1770];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on
