% 多跳网络三种业务类型--吞吐量

clear;clc
lineWidth = 1.2;  % 线宽

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [71.3059,142.7016,214.2931,285.6482,357.0981,428.4526,499.6799,571.1591,492.0701,376.9954];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [65.0036,130.0265,194.8738,260.0912,324.8992,389.8188,455.2504,520.0467,585.7259,650.0283];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [59.6232,118.9011,178.7403,238.4095,297.3034,356.9557,416.4617,476.4204,535.9508,595.2391];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on