% 多跳网络一种业务类型--时延
%   一种业务类型
clear;clc
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [1.4141,1.4776,1.3711,1.4916,1.4095,1.4420,1.4653,1.4368,1.4368,1.4611,1.4314,1.4640,1.4464,1.4271,1.4579,1.4419,1.4505,1.4402,1.4464,1.4491,1.4420,1.4530,1.9217,2.2603,2.6249,3.0889,3.6237,4.1272,4.8304,5.5818];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延1');
