% 多跳网络两种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [10.1948,20.7362,33.1743,41.1558,52.5139,58.6920,72.9568,83.4982,90.9063,106.8478,115.4892,123.9607,170.0293,202.5886,242.7852];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A')
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [9.9194,20.1621,29.1515,38.4242,47.0102,59.3930,69.2624,75.4651,86.2844,99.6372,110.6533,120.0693,133.0487,143.0456,154.5463];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on
