% 多跳网络四种业务类型--吞吐量

clear;clc
lineWidth = 1.2;  % 线宽

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [355.7547,711.242,1066.9867,1422.7933,1778.4933,1788.26,766.9177];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [347.8243,695.5103,1043.3033,1390.8033,1738.64,2086.4467,2434.3633];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [339.8207,679.685,1019.3433,1359.6,1699.4233,2038.8767,2378.8633];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [331.7507,663.6797,995.7023,1327.4867,1659.5133,1991.5667,2323.3567];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量4');