% 多跳网络一种业务类型--时延
%   一种业务类型
clear;clc
x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [5.046, 4.971, 5.046, 4.941, 4.95, 4.971, 4.9817, 4.956, 4.9827, 5.022, 4.9642, 4.9785, 4.9629, 4.986, 4.974, 4.986, 5.016, 5.0043, 4.9544, 4.98, 4.9774, 4.9669, 6.5643, 7.7886, 9.0825, 10.6103, 12.2497, 14.2522, 16.5822, 19.2714];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延1');
