% 多跳网络两种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [1.3901,1.4711,1.4631,1.4626,1.4733,1.4608,1.4601,1.4750,1.4812,1.4612,1.4411,1.9180,2.2315,2.5617,2.9548];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A')
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [1.4997,1.4677,1.4517,1.4094,1.4871,1.4385,1.4493,1.4296,1.4501,1.4079,1.4347,1.4407,1.4107,1.4064,1.4228];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延2');
