% 多跳网络三种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [5.7187, 5.4499, 5.5283, 5.6431, 5.5642, 5.6179, 5.5651, 15.3684, 34.8346, 77.6434];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [5.158, 5.1739, 5.2004, 5.3011, 5.3106, 5.211, 5.2261, 7.3289, 10.3382, 13.2883];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[4.926, 4.941, 5.006, 4.956, 4.986, 4.991, 4.9689, 5.001, 4.9193, 4.986];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延3');