% 多跳网络三种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [1.4491,1.4161,1.4958,1.5064,1.4539,1.4475,1.4550,1.9412,2.2491,2.5270];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [1.3887,1.4442,1.4030,1.3909,1.4351,1.4149,1.4198,1.4541,1.4066,1.4362];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[1.3983,1.4083,1.3729,1.4200,1.3845,1.4099,1.3997,1.3730,1.4053,1.3712];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延3');