% 多跳网络两种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [5.3488, 5.317, 5.2958, 5.2852, 5.2216, 5.2428, 5.2625, 5.2693, 5.2569, 5.2852, 5.2881, 10.4594, 17.7653, 29.6665, 49.4742];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A')
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [5.046, 5.001, 5.066, 4.956, 4.98, 4.936, 4.9731, 4.9748, 4.9727, 4.938, 4.986, 4.9235, 4.9537, 4.971, 4.992];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_时延2');
