% 多跳网络三种业务类型--吞吐量

clear;clc
lineWidth = 1.2;  % 线宽

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [355.6577,711.3167,1067.0433,1422.6667,1778.36,2134.0467,2489.9233,2400.7633,1697.3633,1014.93];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [347.6963,695.6407,1043.53,1390.9233,1738.9367,2086.4933,2434.3433,2782.2533,3130.0033,3477.32];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [339.8533,679.7293,1019.7033,1359.2967,1699.59,2039.09,2378.3833,2718.8367,3058.3167,3398.3833];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量3');