% 多跳网络两种业务类型--吞吐量

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [341.2080,682.4940,1023.7033,1365.1700,1706.4800,2047.9767,2388.7700,2730.2100,3071.2933,3412.7867,3754.1300,3560.1467,3239.3000,2909.1733,2574.8533];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [333.6020,667.1813,1001.0500,1334.6367,1668.1967,2002.2067,2336.0467,2669.3467,3003.5433,3337.0000,3670.2667,4004.7033,4337.2667,4672.1433,5005.5133];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量2');