% 多跳网络两种业务类型--时延

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [71.278,142.7828,214.2804,285.5715,356.9538,428.3543,499.8817,571.0557,642.6718,713.8549,785.0964,856.8869,767.344,752.7958,694.1204];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [64.9404,130.2299,194.8139,259.9678,324.8041,390.0855,454.8674,519.9623,584.945,650.253,715.035,780.3811,845.7944,906.3706,965.9709];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on
