% 多跳网络三种业务类型--吞吐量

clear;clc
lineWidth = 1.2;  % 线宽

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [485.554, 969.981, 1454.84, 1941.24, 2425.74, 2910.7, 3397.32, 2971.31, 2065.12, 1171.94];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [484.741, 970.372, 1455.14, 1938.72, 2425.05, 2910.75, 3394.68, 3880.12, 4365.98, 4850.49];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [485.037, 970.976, 1455.42, 1940.81, 2425.19, 2909.93, 3396.93, 3880.17, 4363.87, 4851.73];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量3');