% 多跳网络一种业务类型--吞吐量
%   一种业务类型
clear;clc;
x1=[2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [341.3167,682.6263,1023.8967,1365.3900,1706.3500,2047.6967,2389.1367,2730.5000,3071.7033,3412.8800,3754.0400,4095.5900,4436.9300,4778.1933,5119.7400,5460.5500,5801.7700,6143.2367,6484.4833,6825.6567,7166.9267,7508.4367,7581.6333,7572.4500,7588.2833,7577.2000,7583.2167,7575.6167,7573.7167,7591.7667];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量1');