% 多跳网络两种业务类型--吞吐量

clear;clc;
lineWidth = 1.2;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [355.5603,711.3413,1067.01,1422.96,1778.5833,2134.0467,2489.7967,2845.4667,3201.0333,3556.22,3912.18,3727.8533,3385.3767,3027.2633,2694.9567];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [355.5603,711.3413,1067.01,1422.96,1778.5833,2134.0467,2489.7967,2845.4667,3201.0333,3556.22,3912.18,3727.8533,3385.3767,3027.2633,2694.9567];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量2');