% 多跳网络三种业务类型--吞吐量

clear;clc
lineWidth = 1.2;  % 线宽

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [341.2410,682.4423,1023.7067,1365.3333,1706.2133,2047.6167,2388.8600,2306.1933,1634.7600,972.3933];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [333.7670,667.3200,1001.0533,1334.8067,1668.4433,2001.9533,2335.7133,2669.8333,3003.1700,3337.0367];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [326.0600,652.1903,978.2413,1304.4867,1630.3467,1956.5467,2282.4767,2609.0900,2935.1533,3260.4867,];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print('-dpng','-r600','性能测试多跳_吞吐量3');