clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%正常通信场景
y1 = [5.7187, 5.4499, 5.5283, 5.6431, 5.5642, 5.6179, 5.5651, 15.3684, 34.8346, 77.6434];

%   三种业务类型-B
y2 = [5.158, 5.1739, 5.2004, 5.3011, 5.3106, 5.211, 5.2261, 7.3289, 10.3382, 13.2883];


%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[4.926, 4.941, 5.006, 4.956, 4.986, 4.991, 4.9689, 5.001, 4.9193, 4.986];

total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '正常通信场景')
hold on
%路由重构场景
%   三种业务类型A
y11 = [27.5856, 27.8376, 27.8096, 27.9216, 28.056, 27.9496, 27.8256, 76.7267, 173.531, 386.652];

%   三种业务类型-B
y22 = [24.0768, 24.0048, 24.0768, 23.8968, 23.6736, 23.6688, 23.8094, 23.6268, 23.7408, 23.9616];


%   三种业务类型-C
y33 = [19.824, 20.004, 19.704, 19.674, 19.752, 19.804, 19.7383, 19.929, 20.0107, 19.776];

total_re_routing = y11 + y22 + y33;
plot(x3,total_re_routing,'*-','linewidth',lineWidth, 'DisplayName', '路由重构场景');

% axis([0 60 5 10]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','路由重构_正常通信_系统时延3');