% 路由重构时延
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [5.8725,5.6225,5.7832,5.7185,5.7069,5.8172,5.8228,5.8155,5.7356,5.6937,5.8376,5.8055,5.8645,5.7568,5.8424,5.8918,5.8085,5.7654,5.8165,5.7741,5.7767,5.8012,7.6342,9.1018,10.6162,12.3891,14.3495,16.8385,19.4227,22.2413];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由重构_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [5.7005,5.8205,5.6912,5.8115,5.8101,5.7198,5.6948,5.7670,5.7823,5.8165,5.7205,7.7240,8.7074,10.1619,11.6614];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A');
hold on;

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [5.8708,5.7828,5.6841,5.8038,5.7972,5.4688,5.7439,5.5573,5.6552,5.6400,5.7267,5.6638,5.7837,5.7733,5.7892];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on;

print(f2,'-dpng','-r600','路由重构_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [5.8125,5.9285,5.6338,6.0945,5.6861,5.8445,5.8874,7.6877,8.7017,9.7810];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [5.9908,5.7040,5.7334,5.6448,5.6732,5.7861,5.7759,5.7218,5.6779,5.7268];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [5.5010,5.5610,5.6557,5.7010,5.6962,5.5317,5.6199,5.6870,5.5219,5.5586];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


axis([0 60 5 10]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','路由重构_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [5.8565,5.8285,5.7632,5.7005,5.7037,7.7059,8.6531];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [5.8308,5.8748,5.6894,5.7008,5.7876,5.6894,5.7433];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [5.5610,5.9190,5.4917,5.5120,5.6474,5.5730,5.6290];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [5.9393,5.5093,5.5246,5.4473,5.4745,5.4499,5.5678];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','路由重构_时延4');