% 路由重构时延
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [33.9558,68.8717,102.0680,134.1167,168.6453,197.4417,231.9973,267.0467,299.2157,329.2250,366.1137,397.4433,435.4393,470.3817,507.6707,538.1067,561.6757,598.5650,631.5737,672.4633,700.3923,732.9083,997.7640,1224.7400,1481.5533,1785.4600,2156.0533,2579.7767,3095.0500,3694.1367];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由重构_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [33.2225,67.7250,102.2542,131.5300,168.2592,199.5750,228.5175,270.7400,299.4825,329.6517,368.5008,523.0461,655.6413,799.4104,986.1918];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A');
hold on;

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [30.2675,63.6150,93.1625,128.0567,160.0975,187.3117,220.6992,250.9933,283.5942,316.2083,344.3025,376.9300,411.0242,437.9583,471.6925];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on;

print(f2,'-dpng','-r600','路由重构_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [33.9292,65.8717,100.4808,133.4900,167.3792,199.8950,232.5975,272.0200,391.5633,497.4283];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [31.2275,62.5483,93.2958,125.6567,154.9508,188.7117,222.2458,252.5933,284.6342,317.7017];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [28.2858,59.5183,86.8842,117.3033,147.1092,179.0750,207.1742,236.4200,267.8792,295.5250];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','路由重构_时延3');