lineWidth = 1.2;  % 线宽
f3 = figure;

y1 = [490.253, 979.075, 1469.48, 1960.93, 2449.81, 2940.27, 3430.38, 3097.32, 2053, 1304.52];

%   三种业务类型-B
y2 = [490.392, 979.653, 1470.25, 1959.71, 2448.03, 2940.69, 3428.35, 3920.5, 4409.3, 4900.83];

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [489.736, 980.624, 1469.34, 1958.97, 2449.96, 2940.52, 3430.7, 3918.17, 4409.7, 4898.65];

%   求出系统吞吐量
total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '正常通信场景')
hold on

%重构的场景
%   三种业务类型-A
y11 = [244.889, 490.064, 734.547, 980.203, 1225.5, 1470.37, 1715.59, 1475.33, 1048.86, 628.195];


%   三种业务类型-B
y22 = [244.932, 489.968, 735.069, 980.365, 1224.84, 1469.81, 1715.06, 1960.47, 2204.94, 2449.03];


%   三种业务类型-C
y33 = [245.229, 489.687, 735.295, 980.167, 1225.13, 1470.63, 1715.15, 1960.2, 2206.21, 2450.77];

total_re_routing = y11 + y22 + y33;
plot(x3,total_re_routing,'*-','linewidth',lineWidth, 'DisplayName', '路由重构场景');

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','路由重构_正常场景_吞吐量对比3');