clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   优化后
%   三种业务类型A
y1 = [8.0736, 7.8816, 7.8976, 7.8336, 7.968, 7.9696, 7.9639, 21.7899, 49.2771, 110.535];

%   三种业务类型-B
y2 = [7.1368, 7.2688, 7.1955, 7.3898, 7.3832, 7.3275, 7.3191, 7.2578, 7.2932, 7.3612];

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [6.808, 6.568, 6.6213, 6.578, 6.624, 6.668, 6.6651, 6.658, 6.5769, 6.64];

%   求出系统吞吐量
total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '优化后')
hold on

%   动态误码场景
%   三种业务类型-A
y11 = [14.2128, 14.0028, 13.8768, 13.8768, 13.9608, 13.7788, 14.0328, 38.2767, 85.9969, 195.195];

%   三种业务类型-B
y22 = [12.4124, 12.5279, 12.5921, 12.7397, 12.6126, 12.6947, 12.8304, 12.7974, 12.9343, 12.7897];

%   三种业务类型-C
y33 = [11.494, 11.634, 11.6107, 11.6165, 11.718, 11.5523, 11.554, 11.599, 11.5718, 11.704];

total_dynamic = y11 + y22 + y33;
plot(x3,total_dynamic,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

axis([0 60 0 250]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','动态误码_跨层优化系统时延对比3');