clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   优化后
%   三种业务类型-A
y1 = [440.818, 882.338, 1322.96, 1765.23, 2206.22, 2645.95, 3087.11, 2780.42, 2115.28, 1236.4];

%   三种业务类型-B
y2 = [440.654, 881.338, 1323.08, 1764.23, 2203.84, 2645.16, 3087.07, 3527.8, 3967.89, 4411.28];

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [440.45, 881.256, 1322.73, 1764.86, 2205.47, 2645.71, 3087.44, 3526.98, 3968.03, 4410.72];

%   求出系统吞吐量
total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '优化后')
hold on

%   动态误码场景,优化前
%   三种业务类型-A
y11 = [392.442, 783.936, 1176.18, 1567.42, 1960.01, 2352.21, 2744.8, 2561.46, 1842.93, 1006.11];

%   三种业务类型-B
y22 = [392.51, 783.917, 1176.41, 1567.7, 1960.1, 2353.07, 2743.8, 3136.49, 3528.16, 3919.49];

%   三种业务类型-C
y33 = [392.222, 783.548, 1176.34, 1567.45, 1959.33, 2350.8, 2743.71, 3136.45, 3528.91, 3919.19];

total_dynamic = y11 + y22 + y33;
plot(x3,total_dynamic,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','动态误码_跨层优化前后系统吞吐量对比3');