% Tcp跨层优化吞吐量——by 链路误码率
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [63.3816,126.4947,189.7607,252.8643,316.0613,379.5290,442.5160,506.1437,568.8777,632.2490,695.1553,758.8180,821.8130,885.2003,948.5237,1011.1000,1074.5400,1137.8833,1201.2433,1264.8433,1328.3000,1389.9333,1416.9000,1409.7000,1424.1000,1414.5000,1410.6000,1424.7000,1420.8000,1410.3000];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [63.1836,126.5118,189.6225,252.5835,316.1337,379.5804,442.3647,506.0097,569.1423,632.3340,695.4264,731.9146,663.3467,620.0517,548.9071];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [56.9346,113.7978,170.7558,227.7462,284.7378,341.2803,398.3742,455.3655,512.2752,569.3727,626.1270,683.4855,744.2832,797.4483,853.8930];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','误码优化_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [63.3528,126.4443,189.6159,252.9177,316.3449,379.4817,442.6629,505.6257,435.7690,340.5837];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [57.0939,113.9307,170.7660,227.5308,284.4462,341.5032,398.6796,455.6553,512.2500,568.9284];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [51.5661,103.1742,154.5876,205.9539,261.4368,308.9895,360.4410,412.2030,463.5417,515.1882];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','误码优化_吞吐量3');