% 跨层优化前后吞吐量对比——by 链路误码
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [56.3067,112.5180,168.6360,224.8047,281.1487,337.4517,393.3210,449.7850,505.8887,562.0493,618.1010,674.4543,730.7353,787.1093,843.2483,899.5800,955.3083,1011.3600,1067.6233,1123.6933,1180.8000,1236.1033,1256.5333,1254.1333,1262.9333,1264.0000,1266.4000,1263.4667,1258.1333,1263.4667];
afterOptY = [63.3816,126.4947,189.7607,252.8643,316.0613,379.5290,442.5160,506.1437,568.8777,632.2490,695.1553,758.8180,821.8130,885.2003,948.5237,1011.1000,1074.5400,1137.8833,1201.2433,1264.8433,1328.3000,1389.9333,1416.9000,1409.7000,1424.1000,1414.5000,1410.6000,1424.7000,1420.8000,1410.3000];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化前后对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [56.1325,112.3995,168.6533,224.8883,281.1035,337.1880,393.4061,449.4669,505.8189,562.1104,617.9429,654.9609,613.1183,541.5781,488.5488];
%   两种业务类型-B
beforeOptY2 = [50.5944,101.0240,151.7677,202.4557,253.0984,303.5003,354.1237,405.0795,455.5611,505.9677,555.9856,607.1725,658.0816,708.5552,759.1845];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [63.1836,126.5118,189.6225,252.5835,316.1337,379.5804,442.3647,506.0097,569.1423,632.3340,695.4264,731.9146,663.3467,620.0517,548.9071];
%   两种业务类型-B
afterOptY2 = [56.9346,113.7978,170.7558,227.7462,284.7378,341.2803,398.3742,455.3655,512.2752,569.3727,626.1270,683.4855,744.2832,797.4483,853.8930];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','误码优化前后对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [56.2432,112.3477,168.7003,224.9360,280.9675,337.2901,393.5736,449.7816,401.4625,308.5022];
%   三种业务类型-B
beforeOptY2 = [50.6075,100.9701,151.7744,202.4440,252.9707,303.6853,353.7493,404.9680,455.4419,506.2251];
%   三种业务类型-C
beforeOptY3 = [45.8744,91.6656,137.5205,183.2501,228.9144,274.9296,320.3821,366.3312,412.4291,458.3395];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [63.3528,126.4443,189.6159,252.9177,316.3449,379.4817,442.6629,505.6257,435.7690,340.5837];
%   三种业务类型-B
afterOptY2 = [57.0939,113.9307,170.7660,227.5308,284.4462,341.5032,398.6796,455.6553,512.2500,568.9284];
%   三种业务类型-C
afterOptY3 = [51.5661,103.1742,154.5876,205.9539,261.4368,308.9895,360.4410,412.2030,463.5417,515.1882];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','误码优化前后对比_吞吐量3');