% Tcp跨层优化吞吐量——by 路由差错消息

close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1=[2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [42.2134,84.3066,126.2886,168.5936,210.6492,252.8276,294.7454,337.247,379.4718,421.6668,463.9024,505.9132,548.1434,590.0486,632.2506,674.5114,716.3828,758.9194,800.7284,843.0792,885.1824,926.874,941.0001,945.6003,950.9999,947.1997,943.5999,937.8008,941.4004,952.3996];
plot(x1,y1,'*-','linewidth',1.2,'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由优化_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [42.171,84.2438,126.4438,168.5586,210.8602,252.8998,295.2004,337.3906,379.3506,421.6118,463.922,494.847,448.8445,419.7271,370.4628];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [38.0088,75.9482,113.8792,151.6784,189.8932,227.584,265.7222,303.713,341.5532,379.271,417.4512,455.3532,493.3554,530.8726,568.9376];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','路由优化_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型-A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [42.1072,84.263,126.4682,168.6196,210.7726,252.932,295.1064,337.3166,301.4587,224.7748];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [37.966,75.9058,113.5556,151.775,189.6728,227.6848,265.7482,303.6558,341.3546,379.251];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [34.4108,68.6808,103.0844,137.5818,171.933,206.035,241.7026,274.785,308.9868,343.5742];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','路由优化_吞吐量3');