% 跨层优化前后吞吐量对比——by 路由差错消息
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [35.0512,70.2952,105.4387,140.4457,175.5853,210.8140,245.9037,280.9610,315.9957,351.6207,386.1977,421.4597,456.7077,491.9940,526.9820,561.7303,597.2307,632.2300,667.3700,702.3440,737.5720,773.0093,783.6667,785.3333,790.3333,779.3333,790.1667,788.8333,786.3333,789.6667];
afterOptY = [42.2134,84.3066,126.2886,168.5936,210.6492,252.8276,294.7454,337.247,379.4718,421.6668,463.9024,505.9132,548.1434,590.0486,632.2506,674.5114,716.3828,758.9194,800.7284,843.0792,885.1824,926.874,941.0001,945.6003,950.9999,947.1997,943.5999,937.8008,941.4004,952.3996];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由优化前后对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [35.1490,70.2903,105.3713,140.4772,175.5325,210.7617,245.9622,280.9817,316.2453,351.3338,386.3548,412.3530,373.2459,341.5135,309.1752];
%   两种业务类型-B
beforeOptY2 = [31.5950,63.2630,94.8053,126.4893,158.1213,189.6032,221.4125,253.0848,284.5693,316.5402,347.8637,379.4803,411.0875,442.6532,474.4917];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [42.171,84.2438,126.4438,168.5586,210.8602,252.8998,295.2004,337.3906,379.3506,421.6118,463.922,494.847,448.8445,419.7271,370.4628];
%   两种业务类型-B
afterOptY2 = [38.0088,75.9482,113.8792,151.6784,189.8932,227.584,265.7222,303.713,341.5532,379.271,417.4512,455.3532,493.3554,530.8726,568.9376];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','路由优化前后对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [35.1793,70.2265,105.3543,140.4723,175.5940,210.7112,245.8375,281.0880,244.4705,179.7923];
%   三种业务类型-B
beforeOptY2 = [31.5882,63.2828,94.9288,126.5557,157.9932,189.7540,221.2100,253.0412,284.6630,316.1635];
%   三种业务类型-C
beforeOptY3 = [28.6078,57.3540,86.0383,114.4617,143.1338,171.6180,200.3448,229.1097,257.6998,286.2108];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [42.1072,84.263,126.4682,168.6196,210.7726,252.932,295.1064,337.3166,301.4587,224.7748];
%   三种业务类型-B
afterOptY2 = [37.966,75.9058,113.5556,151.775,189.6728,227.6848,265.7482,303.6558,341.3546,379.251];
%   三种业务类型-C
afterOptY3 = [34.4108,68.6808,103.0844,137.5818,171.933,206.035,241.7026,274.785,308.9868,343.5742];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','路由优化前后对比_吞吐量3');