clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   优化后
%   三种业务类型A
y1 = [18.9504, 18.6144, 18.5397, 18.4744, 18.4576, 18.3904, 18.3584, 50.5351, 114.331, 256.331];

%   三种业务类型-B
y2 = [15.6672, 15.7152, 15.6352, 15.6672, 15.648, 15.6672, 15.7495, 15.8112, 15.9232, 15.888];

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [13.136, 13.016, 13.0827, 13.036, 13.168, 13.3893, 13.296, 13.196, 13.1093, 13.096];

total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '优化后')
hold on

%   路由重构,优化前
%   三种业务类型A
y11 = [27.5856, 27.8376, 27.8096, 27.9216, 28.056, 27.9496, 27.8256, 76.7267, 173.531, 386.652];

%   三种业务类型-B
y22 = [24.0768, 24.0048, 24.0768, 23.8968, 23.6736, 23.6688, 23.8094, 23.6268, 23.7408, 23.9616];


%   三种业务类型-C
y33 = [19.824, 20.004, 19.704, 19.674, 19.752, 19.804, 19.7383, 19.929, 20.0107, 19.776];

total_re_routing = y11 + y22 + y33;
plot(x3,total_re_routing,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

% axis([0 60 5 10]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','路由重构-跨层优化系统时延对比3');