% Tcp跨层优化时延——by 路由差错消息
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1=[2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [20.775,43.3367,61.8717,80.7667,101.8617,121.0367,143.905,163.3467,186.255,207.1767,217.0983,247.7533,273.2617,282.7033,306.265,327.4267,344.1217,370.07,396.0317,412.74,422.7817,453.2367,624.6208,776.991,940.4166,1148.5681,1368.3049,1663.9901,1994.9864,2409.4045];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由优化_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [21.5483,44.1367,64.2983,82.74,101.715,127.5167,142.385,163.613,172.615,200.2433,227.6983,326.77,402.5257,506.6477,637.6321];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A');
hold on;

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [15.7783,34.61,60.0417,76.94,92.785,118.23,130.6883,154.9333,175.0717,187.9433,213.7483,227.1,248.505,265.8833,297.4883];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on;

print(f2,'-dpng','-r600','路由优化_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [19.6683,35.95,57.485,81.2067,104.275,123.1167,137.465,164.6267,239.7937,311.3215];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [21.0583,39.37,55.7083,79.7667,88.4917,114.51,137.9817,151.64,171.4317,200.9033];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3=[6,12,18,24,30,36,42,48,54,60];
y3=[15.6217,34.9233,56.7583,71.98,84.095,104.6233,128.3417,142.5867,155.8617,178.31];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','路由优化_时延3');