lineWidth = 1.2;  % 线宽
f3 = figure;
%   优化后
%   三种业务类型-A
y1 = [294.227, 587.608, 881.528, 1176.24, 1470.39, 1764.1, 2058.61, 1784.63, 1325.64, 675.422];

%   三种业务类型-B
y2 = [293.685, 587.894, 881.894, 1176.05, 1470.68, 1764.07, 2058.13, 2352.47, 2646.39, 2940.88];

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [293.824, 587.829, 882.677, 1176.39, 1469.78, 1764.49, 2058.66, 2352.5, 2647.16, 2940.5];

%   求出系统吞吐量
total = y1 + y2 + y3;
plot(x3,total,'*-','linewidth',lineWidth, 'DisplayName', '优化后')
hold on

%重构的场景
%   三种业务类型-A
y11 = [244.889, 490.064, 734.547, 980.203, 1225.5, 1470.37, 1715.59, 1475.33, 1048.86, 628.195];


%   三种业务类型-B
y22 = [244.932, 489.968, 735.069, 980.365, 1224.84, 1469.81, 1715.06, 1960.47, 2204.94, 2449.03];


%   三种业务类型-C
y33 = [245.229, 489.687, 735.295, 980.167, 1225.13, 1470.63, 1715.15, 1960.2, 2206.21, 2450.77];

total_re_routing = y11 + y22 + y33;
plot(x3,total_re_routing,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统吞吐量之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','路由重构-跨层优化吞吐量对比3');