% Tcp跨层优化时延——by 链路误码率
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [6.608, 6.568, 6.608, 6.728, 6.736, 6.5947, 6.6194, 6.543, 6.6391, 6.636, 6.6734, 6.6413, 6.6018, 6.5966, 6.5787, 6.638, 6.6551, 6.6436, 6.5975, 6.628, 6.6442, 6.6298, 8.7662, 10.3248, 12.1538, 14.1474, 16.5856, 19.1403, 21.9806, 25.5153];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [7.2248, 7.4448, 7.4008, 7.1808, 7.3304, 7.2981, 7.2562, 7.2688, 7.2737, 7.3348, 7.2688, 14.385, 24.4169, 41.2263, 69.1161];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A');
hold on;

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [6.488, 6.568, 6.6347, 6.688, 6.624, 6.6747, 6.5966, 6.563, 6.688, 6.668, 6.6262, 6.588, 6.6111, 6.5937, 6.6133];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on;

print(f2,'-dpng','-r600','误码优化_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [8.0736, 7.8816, 7.8976, 7.8336, 7.968, 7.9696, 7.9639, 21.7899, 49.2771, 110.535];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [7.1368, 7.2688, 7.1955, 7.3898, 7.3832, 7.3275, 7.3191, 7.2578, 7.2932, 7.3612];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [6.808, 6.568, 6.6213, 6.578, 6.624, 6.668, 6.6651, 6.658, 6.5769, 6.64];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','误码优化_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [8.6424, 8.8504, 8.5211, 8.5644, 8.788, 47.7715, 152.737];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [8.1216, 8.0736, 8.0256, 8.0736, 8.0064, 7.8416, 7.9982];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [7.1368, 7.4448, 7.1661, 7.4448, 7.3216, 7.2468, 7.2625];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [6.688, 6.628, 6.648, 6.628, 6.672, 6.6213, 6.6766];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','误码优化_时延4');