% 跨层优化前后吞吐量对比——by 链路误码
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [392.314, 783.966, 1175.68, 1567.91, 1960.28, 2352.72, 2744.2, 3136.89, 3528.43, 3920.16, 4314.69, 4702.29, 5095.39, 5486.85, 5881.28, 6271.46, 6664.26, 7056.86, 7449.92, 7839.32, 8233.54, 8626.04, 8908.8, 8800, 8742.4, 8934.4, 8825.6, 8857.6, 8838.4, 8780.8];
afterOptY = [440.47, 882.494, 1322.83, 1764.67, 2206.97, 2644.61, 3086.41, 3528.51, 3970.13, 4408.71, 4850.9, 5291.78, 5731.54, 6173.79, 6617.28, 7055.67, 7498.05, 7935.28, 8379.86, 8818.92, 9260.62, 9702.99, 9741.6, 9979.2, 10036.8, 10065.6, 9993.6, 9763.2, 9792, 9806.4];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化前后对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [391.652, 783.925, 1175.69, 1568.08, 1959.33, 2351.9, 2744.04, 3136.64, 3528.56, 3921.14, 4312.41, 3991.66, 3608.93, 3279.95, 2852.76];
%   两种业务类型-B
beforeOptY2 = [392.07, 783.29, 1176.22, 1567.72, 1960.77, 2351.04, 2744.78, 3134.76, 3528.09, 3921, 4311.78, 4705.94, 5095.07, 5488.05, 5876.84];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [441.199, 882.11, 1322.25, 1763.71, 2205.74, 2647.5, 3087.3, 3526.98, 3968.33, 4408.08, 4849.54, 4759.88, 4231.52, 3661.12, 3154.11];
%   两种业务类型-B
afterOptY2 = [440.446, 882.031, 1322.91, 1763.8, 2205.95, 2645.23, 3087.08, 3527.79, 3969.25, 4408.74, 4850.68, 5291.32, 5733.28, 6174.08, 6616.29];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','误码优化前后对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [392.442, 783.936, 1176.18, 1567.42, 1960.01, 2352.21, 2744.8, 2661.46, 1742.93, 1006.11];
%   三种业务类型-B
beforeOptY2 = [392.51, 783.917, 1176.41, 1567.7, 1960.1, 2353.07, 2743.8, 3136.49, 3528.16, 3919.49];
%   三种业务类型-C
beforeOptY3 = [392.222, 783.548, 1176.34, 1567.45, 1959.33, 2350.8, 2743.71, 3136.45, 3528.91, 3919.19];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [440.818, 882.338, 1322.96, 1765.23, 2206.22, 2645.95, 3087.11, 2780.42, 2115.28, 1236.4];
%   三种业务类型-B
afterOptY2 = [440.654, 881.338, 1323.08, 1764.23, 2203.84, 2645.16, 3087.07, 3527.8, 3967.89, 4411.28];
%   三种业务类型-C
afterOptY3 = [440.45, 881.256, 1322.73, 1764.86, 2205.47, 2645.71, 3087.44, 3526.98, 3968.03, 4410.72];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','误码优化前后对比_吞吐量3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

hold on
x = [8,16,24,32,40,48,56];
%   四种业务类型-A
beforeOptY1 = [391.535, 783.533, 1175.65, 1567.66, 1958.96, 1646.84, 677.984];
%   四种业务类型-B
beforeOptY2 = [391.962, 783.398, 1175.58, 1567.73, 1960.19, 2352.21, 2744.87];
%   四种业务类型-C
beforeOptY3 = [391.761, 783.887, 1176.2, 1567.73, 1961.27, 2352.52, 2742.07];
%   四种业务类型-D
beforeOptY4 = [391.684, 783.452, 1175.79, 1568.1, 1960.44, 2352.43, 2743.87];

beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3 + beforeOptY4;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   四种业务类型-A
afterOptY1 = [440.832, 881.304, 1322.88, 1764.22, 2204.95, 2111.27, 725.374];
%   四种业务类型-B
afterOptY2 = [441.022, 881.362, 1322.84, 1763.02, 2204.77, 2646.19, 3087.75];
%   四种业务类型-C
afterOptY3 = [440.731, 882.058, 1322.79, 1763.96, 2203.38, 2647.11, 3086.9];
%   四种业务类型-D
afterOptY4 = [441.427, 882.42, 1322.7, 1764.23, 2203.97, 2646.64, 3086.37];

afterOptY = afterOptY1 + afterOptY2 + afterOptY3 + afterOptY4;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f4,'-dpng','-r600','误码优化前后对比_吞吐量4');