% Tcp跨层优化时延——by 路由差错消息
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [13.216, 12.936, 13.1093, 13.196, 13.168, 13.136, 13.2389, 13.286, 13.296, 13.328, 13.3033, 13.2693, 13.2898, 13.2731, 13.2907, 13.296, 13.2772, 13.2827, 13.2623, 13.244, 13.2617, 13.2705, 17.5002, 20.6692, 24.2416, 28.2729, 32.8792, 38.1358, 44.1783, 50.8213];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由优化_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [16.2432, 15.9552, 15.8912, 15.8352, 15.8208, 15.7632, 15.7358, 15.7512, 15.7419, 15.7344, 15.7283, 31.1161, 52.9205, 88.6863, 148.36];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A');
hold on;

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [13.056, 13.096, 13.0293, 13.056, 13.04, 13.056, 13.1246, 13.176, 13.2693, 13.24, 13.2524, 13.236, 13.2283, 13.2103, 13.168];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on;

print(f2,'-dpng','-r600','路由优化_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [18.9504, 18.6144, 18.5397, 18.4744, 18.4576, 18.3904, 18.3584, 50.5351, 114.331, 256.331];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [15.6672, 15.7152, 15.6352, 15.6672, 15.648, 15.6672, 15.7495, 15.8112, 15.9232, 15.888];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [13.136, 13.016, 13.0827, 13.036, 13.168, 13.3893, 13.296, 13.196, 13.1093, 13.096];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','路由优化_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [21.6576, 21.2736, 21.1883, 21.1136, 21.0944, 115.597, 309.381];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [18.2784, 18.3344, 18.2411, 18.2784, 18.256, 18.2784, 18.3744];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [15.7632, 15.6192, 15.6992, 15.6432, 15.8016, 16.0672, 15.9552];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [13.056, 13.096, 13.0293, 13.316, 13.312, 13.0827, 13.1246];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','路由优化_时延4');