% Tcp跨层优化时延——by 链路误码率
close all;  % 关闭所有图形窗口

%%   一种业务类型
clear;clc;
f1 = figure;

x1 = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
y1 = [1.8948,1.8862,1.8895,1.9098,1.8868,1.9355,1.9308,1.9367,1.9322,1.9468,1.9354,1.9358,1.9327,1.9314,1.9523,1.9269,1.9375,1.9205,1.9174,1.9330,1.9416,1.9236,2.5993,2.9619,3.5120,4.1301,4.8010,5.4796,6.4417,7.5162];
plot(x1,y1,'*-','linewidth',1.2, 'DisplayName', '业务类型A');
hold on

% axis([0 60 0 1000]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

%   两种业务类型-A
x1 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y1 = [1.8815,1.8962,1.8846,1.9332,1.9455,1.9804,1.9889,1.9562,1.9117,1.9327,1.9622,2.5559,2.9868,3.3765,3.9409];
plot(x1,y1,'*-','linewidth',lineWidth,'DisplayName', '业务类型A');
hold on;

%   两种业务类型-B
x2 = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
y2 = [1.9863,1.9289,1.9480,1.8716,1.9233,1.9285,1.8973,1.9183,1.8953,1.9245,1.8855,1.8776,1.8949,1.9014,1.9003];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B');

% axis([0 60 0 300]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on;

print(f2,'-dpng','-r600','误码优化_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

%   三种业务类型A
x1 = [6,12,18,24,30,36,42,48,54,60];
y1 = [1.9055,1.9355,1.9659,1.9458,1.8836,1.9575,1.9537,2.5709,2.8900,3.3532];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A')
hold on

%   三种业务类型-B
x2 = [6,12,18,24,30,36,42,48,54,60];
y2 = [1.8196,1.8809,1.9054,1.8806,1.9308,1.9167,1.8996,1.9549,1.8800,1.8824];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')
hold on

%   三种业务类型-C
x3 = [6,12,18,24,30,36,42,48,54,60];
y3 = [1.8923,1.9397,1.8506,1.8637,1.9270,1.8983,1.8681,1.8972,1.8682,1.8734];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C');


% axis([0 60 0 900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','误码优化_时延3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

%   四种业务类型-A
x1 = [8,16,24,32,40,48,56];
y1 = [1.7855,1.9362,1.9437,1.9752,1.9314,2.5613,2.9238];
plot(x1,y1,'*-','linewidth',lineWidth, 'DisplayName', '业务类型A');
hold on

%   四种业务类型-B
x2 = [8,16,24,32,40,48,56];
y2 = [1.9916,1.8903,1.8916,1.9003,1.9191,1.9154,1.8935];
plot(x2,y2,'o-','linewidth',lineWidth, 'DisplayName', '业务类型B')

%   四种业务类型-C
x3 = [8,16,24,32,40,48,56];
y3 = [1.7803,1.9237,1.8910,1.8283,1.9321,1.8761,1.8712];
plot(x3,y3,'s-','linewidth',lineWidth, 'DisplayName', '业务类型C')

%   四种业务类型-D
x4 = [8,16,24,32,40,48,56];
y4 = [1.7998,1.8764,1.8424,1.8208,1.8803,1.8140,1.8266];
plot(x4,y4,'^-','linewidth',lineWidth, 'DisplayName', '业务类型D')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT节点数与系统时延之间的关系','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f4,'-dpng','-r600','误码优化_时延4');