% 跨层优化前后吞吐量对比——by 路由差错消息
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [179.6210,359.2967,538.7273,718.4403,898.2150,1077.6767,1257.4967,1436.9533,1616.6433,1796.2100,1975.9133,2155.4400,2335.2033,2514.7167,2694.3567,2874.0033,3053.7100,3233.2700,3413.0000,3592.6367,3771.7433,3951.7300,3988.1667,3985.5000,3986.0000,3988.0000,3989.1667,3984.0000,3981.6667,3991.8333];
afterOptY = [215.5760,430.9967,646.6747,862.1000,1077.6733,1293.2367,1508.9867,1724.2700,1939.9533,2155.4133,2371.0900,2586.4967,2802.2800,3017.7967,3233.3000,3448.7967,3664.5400,3880.0333,4095.4567,4311.5067,4526.5767,4742.0833,4784.8000,4776.8000,4794.2000,4775.4000,4790.0000,4781.8000,4791.0000,4786.8000];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由优化前后对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [179.6053,359.1687,538.9250,718.4183,898.1023,1077.8267,1257.4333,1436.9333,1616.7733,1796.3967,1975.7467,1873.4000,1702.2367,1526.9700,1353.7033];
%   两种业务类型-B
beforeOptY2 = [175.6463,351.2020,526.8760,702.4143,878.1160,1053.6067,1229.3033,1404.9567,1580.5767,1756.1167,1931.9567,2107.7667,2282.9333,2458.6967,2634.2967];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [215.4947,431.0750,646.6047,862.0470,1077.7267,1293.3433,1508.8533,1724.6567,1940.2900,2155.5233,2371.1200,2259.5600,2033.3967,1827.3533,1627.8067];
%   两种业务类型-B
afterOptY2 = [210.8180,421.5280,632.3457,843.0053,1053.7000,1264.4633,1475.2267,1685.9967,1896.6833,2107.4667,2318.3167,2529.2400,2739.6033,2950.8467,3161.5933];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','路由优化前后对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [179.6293,359.2350,538.9533,718.3530,898.2037,1077.6467,1257.3233,1209.7833,853.2430,515.0560];
%   三种业务类型-B
beforeOptY2 = [175.6357,351.2047,526.8633,702.5413,878.0433,1053.7867,1229.4833,1405.0200,1580.6833,1756.3467];
%   三种业务类型-C
beforeOptY3 = [171.6413,343.3037,514.9023,686.5143,858.0600,1029.7200,1201.4767,1373.0300,1544.9100,1716.0967];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [215.5840,431.1807,646.8050,862.0307,1077.7967,1293.2700,1508.9067,1454.9933,1035.5467,620.7343];
%   三种业务类型-B
afterOptY2 = [210.7887,421.4170,632.2063,842.9987,1053.8233,1264.4600,1475.3200,1685.9000,1896.8833,2107.2633];
%   三种业务类型-C
afterOptY3 = [205.9783,411.8210,617.8763,823.6703,1029.6500,1235.7133,1441.4900,1647.7100,1853.5700,2059.4067];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','路由优化前后对比_吞吐量3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

hold on
x = [8,16,24,32,40,48,56];
%   四种业务类型-A
beforeOptY1 = [179.6860,359.2423,538.8257,718.4667,898.0887,889.9647,381.3050];
%   四种业务类型-B
beforeOptY2 = [175.5663,351.2267,526.9090,702.6803,878.1453,1053.7967,1229.3733];
%   四种业务类型-C
beforeOptY3 = [171.6217,343.1840,514.7563,686.4297,858.2927,1029.7967,1201.4700];
%   四种业务类型-D
beforeOptY4 = [167.6513,335.1700,502.9120,670.4090,837.9917,1005.7300,1173.3200];

beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3 + beforeOptY4;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   四种业务类型-A
afterOptY1 = [215.5883,431.1073,646.7367,862.3757,1077.7600,1073.6667,459.5207];
%   四种业务类型-B
afterOptY2 = [210.7710,421.4980,632.2653,842.9563,1053.6533,1264.4400,1475.5133];
%   四种业务类型-C
afterOptY3 = [205.9177,411.8757,617.9427,823.8317,1029.7133,1235.7000,1441.5600];
%   四种业务类型-D
afterOptY4 = [201.1723,402.3487,603.3977,804.6637,1005.8767,1206.9900,1408.0067];

afterOptY = afterOptY1 + afterOptY2 + afterOptY3 + afterOptY4;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f4,'-dpng','-r600','路由优化前后对比_吞吐量4');