% 跨层优化前后吞吐量对比——by 链路误码
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [287.4027,574.8680,862.4267,1149.3833,1436.9500,1724.4500,2011.5200,2299.1567,2586.6500,2873.8933,3161.2667,3449.0533,3736.1600,4023.1700,4310.7733,4598.3433,4885.7200,5173.2400,5460.4133,5748.0300,6035.2033,6322.4367,6383.7333,6373.0667,6369.6000,6386.6667,6378.6667,6387.4667,6390.4000,6385.6000];
afterOptY = [323.3570,646.6177,969.8090,1293.4667,1616.8200,1939.9067,2263.2367,2586.4267,2909.8200,3233.3467,3556.3800,3879.8100,4203.0933,4526.3100,4850.4733,5172.8800,5496.4867,5819.6867,6142.8600,6466.5067,6789.7600,7113.0433,7188.0000,7183.2000,7175.4000,7177.2000,7181.4000,7166.1000,7180.5000,7188.0000];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化前后对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [287.4097,574.7800,862.2830,1149.7267,1436.8267,1724.3400,2012.0400,2299.5400,2586.6400,2873.8433,3161.0733,3012.1767,2723.9367,2460.6867,2161.6567];
%   两种业务类型-B
beforeOptY2 = [280.9560,561.9443,842.9097,1123.8300,1405.2333,1686.2433,1966.7333,2248.2900,2528.9167,2810.0067,3091.3700,3372.0900,3652.8633,3933.9800,4215.1433];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [323.3310,646.5840,969.9670,1293.6000,1616.4467,1939.6667,2263.0867,2586.1800,2909.8100,3232.8933,3556.4733,3391.7967,3062.7167,2737.4967,2438.5300];
%   两种业务类型-B
afterOptY2 = [316.0333,632.1623,948.3560,1264.5500,1580.7767,1896.7500,2213.0800,2529.0767,2845.3100,3161.1867,3477.5367,3793.8033,4109.3833,4425.6033,4741.6700];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','误码优化前后对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [287.5537,574.6940,862.2850,1149.6933,1437.1567,1724.4833,2011.7833,1936.4300,1375.4133,829.0960];
%   三种业务类型-B
beforeOptY2 = [280.9387,562.0730,842.8660,1124.0400,1405.1233,1685.9400,1967.3167,2247.8233,2529.1300,2810.0533];
%   三种业务类型-C
beforeOptY3 = [274.4940,548.9640,823.7340,1097.9000,1373.1200,1648.0100,1922.3700,2196.6500,2471.6500,2746.3400];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [323.3013,646.6503,970.1673,1293.3333,1616.4733,1940.0667,2263.2367,2172.6633,1548.0933,924.0530];
%   三种业务类型-B
afterOptY2 = [316.1697,632.2677,948.3593,1264.5267,1580.5500,1896.5400,2212.9867,2529.1567,2844.9467,3161.5433];
%   三种业务类型-C
afterOptY3 = [309.0490,617.8107,926.8717,1235.5800,1544.4067,1853.3900,2162.5900,2471.4767,2780.2600,3089.2067];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','误码优化前后对比_吞吐量3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

hold on
x = [8,16,24,32,40,48,56];
%   四种业务类型-A
beforeOptY1 = [287.3397,574.7050,862.2440,1149.5300,1437.0433,1426.7533,616.8837];
%   四种业务类型-B
beforeOptY2 = [280.8220,561.9750,843.0140,1124.3000,1405.1500,1686.3300,1966.9700];
%   四种业务类型-C
beforeOptY3 = [274.6190,549.3737,823.8870,1098.1700,1372.9567,1647.7400,1922.1800];
%   四种业务类型-D
beforeOptY4 = [268.0743,536.2960,804.5897,1072.7800,1340.9633,1609.1233,1877.4133];

beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3 + beforeOptY4;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   四种业务类型-A
afterOptY1 = [323.3527,646.5047,969.8377,1293.4400,1616.6833,1622.7133,686.9483];
%   四种业务类型-B
afterOptY2 = [316.0443,632.2090,948.3093,1264.7700,1580.5867,1896.6333,2212.8167];
%   四种业务类型-C
afterOptY3 = [308.9660,617.8097,926.6917,1235.9200,1544.7400,1853.4767,2162.4000];
%   四种业务类型-D
afterOptY4 = [301.7157,603.3880,904.8220,1206.7100,1508.7533,1810.6733,2111.4367];

afterOptY = afterOptY1 + afterOptY2 + afterOptY3 + afterOptY4;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f4,'-dpng','-r600','误码优化前后对比_吞吐量4');