% 跨层优化前后时延对比——by 链路误码
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [19.8564,40.9929,63.5561,83.0558,101.6659,119.5057,143.4620,159.7383,186.3947,202.7077,223.6807,246.1210,265.8777,283.4940,309.5203,326.4067,342.3430,370.3460,387.0457,410.3690,431.4927,438.0057,598.5683,731.8037,884.1443,1070.3500,1283.3767,1535.8667,1826.7933,2189.5900];
afterOptY = [10.1275,21.4283,30.4092,39.1367,52.7175,65.2583,63.6392,85.8200,96.5877,96.2483,115.0828,124.8233,133.2843,142.9850,150.9263,160.1333,170.1677,169.0150,201.3023,198.2300,203.2643,201.4850,293.3977,378.2123,457.0710,570.9340,699.6730,837.8040,1000.5713,1207.9800];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化时延对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','误码优化前后对比_时延1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [20.6631,38.4729,62.5026,80.2024,101.3455,125.8619,143.8184,159.7381,180.8512,206.8777,223.6041,314.6212,397.2140,481.9218,588.0401];
%   两种业务类型-B
beforeOptY2 = [18.3827,39.4321,54.3282,77.9043,96.3737,117.7497,135.2558,156.0585,173.9779,190.1840,215.3334,232.6395,249.6089,271.3283,287.7510];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [11.2342,18.4950,34.9825,37.3900,47.7175,63.0583,71.1992,80.7667,90.0408,105.3817,108.7758,157.0143,204.0720,248.2664,296.1414];
%   两种业务类型-B
afterOptY2 = [9.3958,15.5650,29.0008,35.7292,44.5525,60.1617,70.9442,85.3800,89.6692,102.1850,105.2875,115.4967,125.1771,128.8483,144.0308];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化时延对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f2,'-dpng','-r600','误码优化前后对比_时延2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [19.8964,39.0395,62.1060,80.3724,101.9755,121.9319,139.2150,160.3281,235.3574,294.9685];
%   三种业务类型-B
beforeOptY2 = [20.3594,38.2855,56.8549,78.5109,94.9470,115.4697,135.3025,160.8819,175.0213,191.8340];
%   三种业务类型-C
beforeOptY3 = [17.0489,36.8045,56.1168,73.7624,90.3847,106.9536,129.6859,143.2448,161.0937,184.1527];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [8.1408,16.9750,27.8892,36.8567,52.5575,61.9783,68.4658,82.9667,128.0109,156.2535];
%   三种业务类型-B
afterOptY2 = [10.5558,19.8183,28.2008,34.9700,47.7792,55.7350,68.5442,66.7800,87.7358,94.4383];
%   三种业务类型-C
afterOptY3 = [9.8375,15.0483,23.7658,37.3233,41.0275,47.9317,63.9558,68.2200,81.7242,98.7617];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化时延对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统时延 (ms)');
grid on

print(f3,'-dpng','-r600','误码优化前后对比_时延3');