% 跨层优化前后吞吐量对比——by 路由差错消息
close all;

%%   一种业务类型
clear;clc;
f1 = figure;

hold on
x = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30,32,34,36,38,40,42,44,46,48,50,52,54,56,58,60];
beforeOptY = [245.14, 490.401, 735.395, 980.467, 1225.02, 1469.9, 1714.29, 1959.23, 2204.56, 2449.77, 2694.43, 2939.06, 3183.96, 3429.24, 3674.2, 3919.27, 4163.91, 4409.19, 4653.61, 4899.01, 5143.77, 5388.77, 5520, 5588, 5496, 5408, 5460, 5532, 5500, 5520];
afterOptY = [293.707, 588.022, 882.256, 1175.9, 1469.9, 1764.59, 2057.99, 2352.34, 2646.39, 2939.91, 3233.64, 3527.84, 3821.91, 4115.95, 4410.18, 4703.7, 4997.38, 5291.67, 5585.39, 5879.69, 6173.16, 6467.59, 6547.2, 6676.8, 6696, 6705.6, 6504, 6547.2, 6667.2, 6556.8];
plot(x,beforeOptY,'*-','linewidth',1.2,'DisplayName', '优化前');
plot(x,afterOptY,'o-','linewidth',1.2,'DisplayName', '优化后');

% axis([0 60 0 1900]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

% 以600分辨率输出图片到当前目录
print(f1,'-dpng','-r600','路由优化前后对比_吞吐量1');

%% 两种业务类型
clear;clc;
lineWidth = 1.2;
f2 = figure;

hold on
x = [4,8,12,16,20,24,28,32,36,40,44,48,52,56,60];
%   两种业务类型-A
beforeOptY1 = [244.979, 490.161, 735.172, 979.655, 1224.76, 1470.36, 1715.67, 1960.53, 2205.6, 2449.98, 2695.24, 2555.63, 2222.15, 2100.99, 1843.83];
%   两种业务类型-B
beforeOptY2 = [244.889, 490.064, 734.547, 980.203, 1225.5, 1470.37, 1715.59, 1960.14, 2205.21, 2450.8, 2694.98, 2940.37, 3185.85, 3431.01, 3676.17];
beforeOptY = beforeOptY1 + beforeOptY2;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');

%   两种业务类型-A
afterOptY1 = [294.005, 587.509, 881.803, 1175.72, 1469.72, 1764.57, 2058.17, 2352.43, 2646.36, 2940.46, 3234.47, 2960.81, 2709.45, 2468.93, 2145.53];
%   两种业务类型-B
afterOptY2 = [294.227, 587.608, 881.528, 1176.24, 1470.39, 1764.1, 2058.61, 2352.38, 2646.31, 2940.78, 3234.89, 3528.79, 3823.35, 4116.67, 4411.27];
afterOptY = afterOptY1 + afterOptY2;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后');

% axis([0 60 0 1100]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f2,'-dpng','-r600','路由优化前后对比_吞吐量2');

%% 三种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f3 = figure;

hold on
x = [6,12,18,24,30,36,42,48,54,60];
%   三种业务类型-A
beforeOptY1 = [244.889, 490.064, 734.547, 980.203, 1225.5, 1470.37, 1715.59, 1575.33, 1048.86, 628.195];
%   三种业务类型-B
beforeOptY2 = [244.932, 489.968, 735.069, 980.365, 1224.84, 1469.81, 1715.06, 1960.47, 2204.94, 2449.03];
%   三种业务类型-C
beforeOptY3 = [245.229, 489.687, 735.295, 980.167, 1225.13, 1470.63, 1715.15, 1960.2, 2206.21, 2450.77];
beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   三种业务类型-A
afterOptY1 = [294.227, 587.608, 881.528, 1176.24, 1470.39, 1764.1, 2058.61, 1784.63, 1325.64, 675.422];
%   三种业务类型-B
afterOptY2 = [293.685, 587.894, 881.894, 1176.05, 1470.68, 1764.07, 2058.13, 2352.47, 2646.39, 2940.88];
%   三种业务类型-C
afterOptY3 = [293.824, 587.829, 882.677, 1176.39, 1469.78, 1764.49, 2058.66, 2352.5, 2647.16, 2940.5];
afterOptY = afterOptY1 + afterOptY2 + afterOptY3;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f3,'-dpng','-r600','路由优化前后对比_吞吐量3');

%% 四种业务类型
clear;clc;
lineWidth = 1.2;  % 线宽
f4 = figure;

hold on
x = [8,16,24,32,40,48,56];
%   四种业务类型-A
beforeOptY1 = [245.239, 490.363, 735.005, 980.257, 1224.8, 1066.8, 334.788];
%   四种业务类型-B
beforeOptY2 = [245.057, 490.012, 735.261, 979.568, 1225.49, 1469.72, 1714.93];
%   四种业务类型-C
beforeOptY3 = [244.943, 489.964, 734.997, 980.865, 1224.43, 1469.64, 1714.62];
%   四种业务类型-D
beforeOptY4 = [244.9, 490.236, 734.761, 979.615, 1225.3, 1469.84, 1715.67];

beforeOptY = beforeOptY1 + beforeOptY2 + beforeOptY3 + beforeOptY4;
plot(x,beforeOptY,'*-','linewidth',lineWidth, 'DisplayName', '优化前');


%   四种业务类型-A
afterOptY1 = [293.685, 587.894, 881.894, 1176.05, 1470.68, 1196.32, 410.274];
%   四种业务类型-B
afterOptY2 = [293.824, 587.829, 882.677, 1176.39, 1469.78, 1764.49, 2058.66];
%   四种业务类型-C
afterOptY3 = [293.81, 587.934, 881.531, 1176.04, 1470.09, 1764.26, 2058.84];
%   四种业务类型-D
afterOptY4 = [293.798, 588.307, 882.571, 1176.34, 1470.69, 1764.53, 2057.82];

afterOptY = afterOptY1 + afterOptY2 + afterOptY3 + afterOptY4;
plot(x,afterOptY,'o-','linewidth',lineWidth, 'DisplayName', '优化后')

% axis([0 60 0 800]);
legend('Location', 'northwest')  % 指定图例位置
legend('boxoff');  % 关闭图例框线

title('TTNT跨层优化吞吐量对比图','FontSize',13);
xlabel('TTNT节点数（个）');
ylabel('系统吞吐量 (Kbps)');
grid on

print(f4,'-dpng','-r600','路由优化前后对比_吞吐量4');